---
kind: property
id: P:Autodesk.Revit.DB.ParameterTypeId.ToposolidFunctionParam
source: html/f32c6610-962b-47f1-4080-8c32af6f4b83.htm
---
# Autodesk.Revit.DB.ParameterTypeId.ToposolidFunctionParam Property

"Function"

## Syntax (C#)
```csharp
public static ForgeTypeId ToposolidFunctionParam { get; }
```